
Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Сорт) + ? (ПустаяСтрока(Комментарий),""," " + Комментарий);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Сорт) + ? (ПустаяСтрока(Комментарий),""," " + Комментарий);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если СезонВыращивания = 0 Тогда
		СезонВыращивания = Константы.ТекущийСезонВыращивания.Получить();
	КонецЕсли;
КонецПроцедуры
