&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭлементОтбораСезон = Неопределено;
	Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = "ыы" Тогда
		КонецЕсли;
	КонецЦикла;
	Если ОтражатьДанныеТолькоТекущегоСезона() Тогда
		Если НЕ ЭлементОтбораСезон = Неопределено Тогда
			ЭлементОтбораСезон.Использование = Истина;
		Иначе
			ЭлементОтбораСезон = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСезон.ЛевоеЗначение = "ыы";
		КонецЕсли;
	Иначе // Фильтр по сезонам должен быть снят
		Если НЕ ЭлементОтбораСезон = Неопределено Тогда
			ЭлементОтбораСезон.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтражатьДанныеТолькоТекущегоСезона()
	Возврат Константы.ОтображатьТолькоДанныеТекущегоСезона.Получить();
КонецФункции