
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = ИспользуемыеМатериалы.Выгрузить();
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ Использовано
		|ИЗ
		|	&ТабИспользовано КАК Т
		|ГДЕ
		|	НЕ Т.Неучитываемый
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Использовано.Номенклатура КАК Номенклатура,
		|	Использовано.Количество КАК Количество,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА Использовано.Количество > СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ТОГДА -1000
		|		КОГДА Использовано.Количество = СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьОстаток
		|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток * Использовано.Количество
		|	КОНЕЦ КАК Стоимость
		|ИЗ
		|	Использовано КАК Использовано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&Дата, ) КАК СебестоимостьТоваровОстатки
		|		ПО Использовано.Номенклатура = СебестоимостьТоваровОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ТабИспользовано",ТЗ);
	Запрос.УстановитьПараметр("Дата",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.СебестоимостьТоваров.Записывать = Истина;
	ОбщаяСтоимость = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Стоимость = -1000 тогда
			Отказ = Истина;
			Сообщить("Не хватает позиции "+ ВыборкаДетальныеЗаписи.Номенклатура);
			Возврат;
		Иначе
			Движение = Движения.СебестоимостьТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
			ОбщаяСтоимость = ОбщаяСтоимость + Движение.Стоимость;
		КонецЕсли;
	КонецЦикла;
	
	Движение = Движения.СебестоимостьТоваров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = ПроизведенныйПродукт;
	Движение.Количество = Количество;
	Движение.Стоимость = ОбщаяСтоимость;
	
КонецПроцедуры
