
Процедура ОбработкаПроведения(Отказ, Режим)
	ОсталосьВес = Количество;
	ОсталосьРастений = Растения.Количество();
	
	Движения.СобраныйУрожай.Записывать = Истина;
	Для Каждого ТекСтрокаРастения Из Растения Цикл
		Движение = Движения.СобраныйУрожай.Добавить();
		Движение.Период = Дата;
		Движение.Растение = ТекСтрокаРастения.Растение;
		Движение.Номенклатура = Урожай;
		
		Если ОсталосьРастений = 1 Тогда 
			Движение.Количество = ОсталосьВес;
		Иначе
			КоличествоНаРастение = ОсталосьВес / ОсталосьРастений;
			Движение.Количество = КоличествоНаРастение;
			ОсталосьВес = ОсталосьВес - Движение.Количество;
			ОсталосьРастений = ОсталосьРастений - 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СезонВыращивания = 0 Тогда
		СезонВыращивания = Константы.ТекущийСезонВыращивания.Получить();
	КонецЕсли;
КонецПроцедуры
